<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of 1Password.

DOWNLOAD_ARCH
- "x86_64": x86_64 (default)
- "aarch64": arm64

DOWNLOAD_BUILD
- "latest": production release (default)
- "latest.BETA": beta release
- "latest.NIGHTLY": nightly release</string>
    <key>Identifier</key>
    <string>com.github.litmus.jamf-recipes.download.1Password</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>1Password</string>
        <key>DOWNLOAD_ARCH</key>
        <string>x86_64</string>
        <key>DOWNLOAD_BUILD</key>
        <string>latest</string>
        <key>DOWNLOAD_URL</key>
        <string>https://downloads.1password.com/mac/1Password.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/1Password.app</string>
                <key>requirement</key>
                <string>identifier "com.1password.1password" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BUA8C4S2C"</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>