<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of 1Password and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.litmus.jamf-recipes.pkg.1Password</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>1Password</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>ParentRecipe</key>
    <string>com.github.litmus.jamf-recipes.download.1Password</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>